VinylTrader-Backend/app/controllers/auth_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "boop"], ["password", "boopy"], ["created_at", "2021-03-03 19:48:48.463731"], ["updated_at", "2021-03-03 19:48:48.463731"]]
---
    def create
        user = User.create(username: params[:username], password: params[:password])