VinylTrader-Backend/app/controllers/vinyls_controller.rb

    def index
      @vinyls = Vinyl.all
---
SELECT "vinyls".* FROM "vinyls"

    def get_by_user_id
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def show
      @vinyl = Vinyl.find(params[:id])
---
SELECT "vinyls".* FROM "vinyls" WHERE "vinyls"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def create
      @vinyl = Vinyl.new(vinyl_params)
        if @vinyl.save
---
INSERT INTO "vinyls" ("image", "title", "artist", "genre", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["image", "hey"], ["title", "hey"], ["artist", "hey"], ["genre", "hey"], ["year", 0], ["created_at", "2021-03-08 21:31:19.841584"], ["updated_at", "2021-03-08 21:31:19.841584"]]

  def update
    @vinyl = Vinyl.find(params[:id])
      if @vinyl
        @vinyl.update(vinyl_params)
---
SELECT "vinyls".* FROM "vinyls" WHERE "vinyls"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "vinyls" SET "artist" = ?, "updated_at" = ? WHERE "vinyls"."id" = ?  [["artist", "Led Coolguys"], ["updated_at", "2021-01-15 19:39:59.671207"], ["id", 13]]

  def destroy
    @vinyl = Vinyl.find(params[:id])
      if @vinyl
        @vinyl.destroy
---
SELECT "vinyls".* FROM "vinyls" WHERE "vinyls"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "vinyls" WHERE "vinyls"."id" = ?  [["id", 28]]